# DS_GetOffset

## Description
Returns document shadow offset.

```pascal
FUNCTION DS_GetOffset : REAL;
```

```python
def vs.DS_GetOffset():
    return REAL
```

## Examples
```pascal
resultVal := DS_GetOffset;
```
```python
import vs

# Returns document shadow offset.
value = vs.DS_GetOffset()
vs.Message('DS_GetOffset returned: ' + str(value))
```

## Version
Availability: from Vectorworks 2014

## Category
* Document Attributes